Repository: Brkgng/ZapPDF
Catalog: App/Localizable.xcstrings
Source language: en
Languages: de, es, fr, ja, tr, zh_hans

source: Renews %@
de: Verlängert sich %@
es: Se renueva el %@
fr: Renouvelé le %@
ja: %@ に更新されます
tr: %@ tarihinde yenilenir
zh_hans: %@ 续订

source: Reordering pages... %@
de: Seiten werden neu geordnet... %@
es: Reordenando páginas... %@
fr: Réorganisation des pages... %@
ja: ページを並べ替え中... %@
tr: Sayfalar yeniden sıralanıyor... %@
zh_hans: 正在重新排序页面... %@

source: Rotated %lld°
de: %lld° gedreht
es: Rotado %lld°
fr: Pivoté de %lld°
ja: %lld°回転
tr: %lld° döndürüldü
zh_hans: 已旋转 %lld°

# Saved %lld of %lld pages
source: Saved %1$lld of %2$lld pages
de: %1$lld von %2$lld Seiten gespeichert
es: Se guardaron %1$lld de %2$lld páginas
fr: %1$lld pages sur %2$lld enregistrées
ja: %2$lld ページ中 %1$lld ページを保存しました
tr: %1$lld / %2$lld sayfa kaydedildi
zh_hans: 已保存 %1$lld/%2$lld 页

source: Saving... %@
de: Speichern... %@
es: Guardando... %@
fr: Enregistrement... %@
ja: 保存中... %@
tr: Kaydediliyor... %@
zh_hans: 正在保存... %@

# scanner.error.allPagesFailed
source: All pages failed to convert.
de: Alle Seiten konnten nicht konvertiert werden.
es: Todas las páginas fallaron al convertir.
fr: Échec de la conversion de toutes les pages.
ja: すべてのページの変換に失敗しました。
tr: Tüm sayfalar dönüştürülemedi.
zh_hans: 所有页面转换失败。

# scanner.error.noImages
source: No images were provided.
de: Keine Bilder bereitgestellt.
es: No se proporcionaron imágenes.
fr: Aucune image fournie.
ja: 画像が提供されていません。
tr: Görüntü sağlanmadı.
zh_hans: 未提供图像。

# scanner.error.notSupported
source: Document scanning is not supported on this device.
de: Dokumentenscanner wird auf diesem Gerät nicht unterstützt.
es: El escaneo de documentos no es compatible con este dispositivo.
fr: La numérisation de documents n'est pas prise en charge sur cet appareil.
ja: このデバイスではドキュメントスキャンはサポートされていません。
tr: Belge tarama bu cihazda desteklenmiyor.
zh_hans: 此设备不支持文档扫描。

# scanner.error.pdfWriteFailed
source: Failed to create PDF from scanned images.
de: PDF konnte nicht aus gescannten Bildern erstellt werden.
es: Error al crear PDF a partir de imágenes escaneadas.
fr: Échec de la création du PDF à partir des images numérisées.
ja: スキャンした画像からのPDF作成に失敗しました。
tr: Taranan görüntülerden PDF oluşturulamadı.
zh_hans: 无法从扫描的图像创建PDF。

# scanner.importFromPhotos
source: Import from Photos
de: Aus Fotos importieren
es: Importar desde fotos
fr: Importer depuis les photos
ja: 写真からインポート
tr: Fotoğraflardan İçe Aktar
zh_hans: 从照片导入

# scanner.processing
source: Creating PDF...
de: PDF wird erstellt...
es: Creando PDF...
fr: Création du PDF...
ja: PDFを作成中...
tr: PDF oluşturuluyor...
zh_hans: 正在创建PDF...

# scanner.scanDocument
source: Scan Document
de: Dokument scannen
es: Escanear documento
fr: Scanner un document
ja: ドキュメントをスキャン
tr: Belge Tara
zh_hans: 扫描文档

# settings.about
source: About
de: Über
es: Acerca de
fr: À propos
ja: ZapPDFについて
tr: Hakkında
zh_hans: 关于

# settings.contactSupport
source: Contact Support
de: Support
es: Soporte
fr: Support
ja: サポート
tr: Destek
zh_hans: 支持

# settings.language
source: Language
de: Sprache
es: Idioma
fr: Langue
ja: 言語
tr: Dil
zh_hans: 语言

# settings.languageDescription
source: Choose your preferred language
de: Wählen Sie Ihre bevorzugte Sprache
es: Elige tu idioma preferido
fr: Choisissez votre langue préférée
ja: 優先言語を選択
tr: Tercih ettiğin dili seç
zh_hans: 选择你的首选语言

# settings.languageRestartMessage
source: Language changes will take effect after restarting the app.
de: Sprachänderungen werden nach einem Neustart der App wirksam.
es: Los cambios de idioma se aplicarán después de reiniciar la app.
fr: Les changements de langue prendront effet après le redémarrage de l'app.
ja: 言語の変更はアプリを再起動すると反映されます。
tr: Dil değişiklikleri uygulama yeniden başlatıldığında geçerli olacak.
zh_hans: 语言更改将在重新启动应用后生效。

# settings.manageSubscription
source: Manage Subscription
de: Abonnement verwalten
es: Administrar suscripción
fr: Gérer l'abonnement
ja: サブスクリプションを管理
tr: Aboneliği Yönet
zh_hans: 管理订阅

# settings.restartRequired
source: Restart Required
de: Neustart erforderlich
es: Reinicio requerido
fr: Redémarrage requis
ja: 再起動が必要
tr: Yeniden başlatma gerekli
zh_hans: 需要重新启动

# settings.restoreNoProducts
source: No previous purchases found.
de: Keine früheren Käufe gefunden.
es: No se encontraron compras anteriores.
fr: Aucun achat précédent trouvé.
ja: 以前の購入が見つかりません。
tr: Önceki satın alım bulunamadı.
zh_hans: 未找到以前的购买记录。

# settings.restorePurchases
source: Restore Purchases
de: Käufe wiederherstellen
es: Restaurar compras
fr: Restaurer les achats
ja: 購入を復元
tr: Satın Alımları Geri Yükle
zh_hans: 恢复购买

# settings.restoreSuccess
source: Purchases restored successfully!
de: Käufe erfolgreich wiederhergestellt!
es: ¡Compras restauradas correctamente!
fr: Achats restaurés avec succès !
ja: 購入が正常に復元されました！
tr: Satın alımlar başarıyla geri yüklendi!
zh_hans: 购买已成功恢复！

# settings.subscription
source: Subscription
de: Abonnement
es: Suscripción
fr: Abonnement
ja: サブスクリプション
tr: Abonelik
zh_hans: 订阅

# settings.subscription.freePlan
source: Free Plan
de: Kostenloser Plan
es: Plan gratuito
fr: Forfait gratuit
ja: 無料プラン
tr: Ücretsiz Plan
zh_hans: 免费版

# settings.subscription.proAnnual
source: Pro Annual
de: Pro Jährlich
es: Pro Anual
fr: Pro Annuel
ja: Pro年間
tr: Pro Yıllık
zh_hans: Pro年订阅

# settings.subscription.proLifetime
source: Pro Lifetime
de: Pro Lebenslang
es: Pro Vitalicio
fr: Pro À vie
ja: Pro永久
tr: Pro Ömür Boyu
zh_hans: Pro终身版

# settings.subscription.proMonthly
source: Pro Monthly
de: Pro Monatlich
es: Pro Mensual
fr: Pro Mensuel
ja: Pro月額
tr: Pro Aylık
zh_hans: Pro月订阅

# settings.systemDefault
source: System Default
de: Systemstandard
es: Sistema predeterminado
fr: Par défaut du système
ja: システムのデフォルト
tr: Sistem Varsayılanı
zh_hans: 跟随系统

# settings.title
source: Settings
de: Einstellungen
es: Ajustes
fr: Réglages
ja: 設定
tr: Ayarlar
zh_hans: 设置

# splitOptions.divideIntoChunks
source: Divide into equal chunks
de: In gleiche Teile aufteilen
es: Dividir en fragmentos iguales
fr: Diviser en parties égales
ja: 均等なチャンクに分割
tr: Eşit parçalara böl
zh_hans: 等分拆分

# splitOptions.enterPageRanges
source: Enter page numbers and ranges separated by commas
de: Seitenzahlen und -bereiche durch Kommas getrennt eingeben
es: Ingresa números de página y rangos separados por comas
fr: Entrez les numéros de page et les plages séparés par des virgules
ja: カンマ区切りでページ番号と範囲を入力
tr: Sayfa numaralarını ve aralıklarını virgülle ayırarak gir
zh_hans: 输入页码和范围，用逗号分隔

# splitOptions.everyN
source: Every N
de: Alle N
es: Cada N
fr: Toutes les N
ja: N ページごと
tr: Her N
zh_hans: 每N页

# splitOptions.modeDesc.pageRange
source: Enter page ranges like 1-5, 10, 15-20
de: Seitenbereiche eingeben wie 1-5, 10, 15-20
es: Ingresa rangos de páginas como 1-5, 10, 15-20
fr: Entrez des plages de pages comme 1-5, 10, 15-20
ja: 1-5, 10, 15-20のような範囲を入力
tr: 1-5, 10, 15-20 gibi sayfa aralıkları gir
zh_hans: 输入页面范围，如 1-5, 10, 15-20

# splitOptions.modeDesc.selectPages
source: Tap pages to select them
de: Tippe auf Seiten, um sie auszuwählen
es: Toca las páginas para seleccionarlas
fr: Touchez les pages pour les sélectionner
ja: タップしてページを選択
tr: Seçmek için sayfalara dokun
zh_hans: 点击页面进行选择

# splitOptions.modeDesc.splitEvery
source: Divide PDF into chunks of N pages each
de: PDF in Abschnitte von je N Seiten aufteilen
es: Divide el PDF en fragmentos de N páginas cada uno
fr: Diviser le PDF en sections de N pages chacune
ja: PDFをN ページずつに分割
tr: PDF'i N sayfalık parçalara böl
zh_hans: 将PDF按每N页拆分

# splitOptions.noOutput
source: No output files will be created
de: Es werden keine Ausgabedateien erstellt
es: No se crearán archivos de salida
fr: Aucun fichier de sortie ne sera créé
ja: 出力ファイルは作成されません
tr: Çıktı dosyası oluşturulmayacak
zh_hans: 不会创建输出文件

# splitOptions.options
source: Options
de: Optionen
es: Opciones
ja: オプション
tr: Seçenekler
zh_hans: 选项

# splitOptions.outputPreview
source: Output Preview
de: Ausgabevorschau
es: Vista previa de salida
fr: Aperçu de la sortie
ja: 出力プレビュー
tr: Çıktı Önizleme
zh_hans: 输出预览

# splitOptions.pageCountPlural %lld
source: %lld pages
de: %lld Seiten
es: %lld páginas
ja: %lld ページ
tr: %lld sayfa
zh_hans: %lld 页

# splitOptions.pagesPerFile
source: Pages per file:
de: Seiten pro Datei:
es: Páginas por archivo:
fr: Pages par fichier :
ja: ファイルあたりのページ数:
tr: Dosya başına sayfa:
zh_hans: 每个文件的页数：

# splitOptions.pickPagesVisually
source: Pick individual pages visually
de: Einzelne Seiten visuell auswählen
es: Elige páginas individuales visualmente
fr: Sélectionner visuellement les pages
ja: 個別のページを視覚的に選択
tr: Sayfaları görsel olarak seç
zh_hans: 可视化选择单独页面

# splitOptions.rangePlaceholder
source: e.g., 1-5, 10, 15-20
de: z.B. 1-5, 10, 15-20
es: ej., 1-5, 10, 15-20
fr: ex. 1-5, 10, 15-20
ja: 例: 1-5, 10, 15-20
tr: ör. 1-5, 10, 15-20
zh_hans: 如：1-5, 10, 15-20

# splitOptions.ranges
source: Ranges
de: Bereiche
es: Rangos
fr: Plages
ja: 範囲
tr: Aralıklar
zh_hans: 范围

# splitOptions.select
source: Select
de: Auswählen
es: Seleccionar
fr: Sélectionner
ja: 選択
tr: Seç
zh_hans: 选择

# splitOptions.selectPagesToExtract
source: Select pages to extract:
de: Wähle die zu extrahierenden Seiten:
es: Selecciona las páginas a extraer:
fr: Sélectionnez les pages à extraire :
ja: 抽出するページを選択:
tr: Çıkartılacak sayfaları seç:
zh_hans: 选择要提取的页面：

# splitOptions.specifyRanges
source: Specify ranges like 1-5, 10-15
de: Bereiche angeben wie 1-5, 10-15
es: Especifica rangos como 1-5, 10-15
fr: Spécifiez des plages comme 1-5, 10-15
ja: 1-5, 10-15のような範囲を指定
tr: 1-5, 10-15 gibi aralıklar belirt
zh_hans: 指定范围，如 1-5, 10-15

# splitOptions.split
source: Split
de: Teilen
es: Dividir
fr: Diviser
ja: 分割
tr: Böl
zh_hans: 拆分

# splitOptions.splitMode
source: Split Mode
de: Teilungsmodus
es: Modo de división
fr: Mode de division
ja: 分割モード
tr: Bölme Modu
zh_hans: 拆分模式

# splitOptions.title
source: Split Options
de: Teilungsoptionen
es: Opciones de división
fr: Options de division
ja: 分割オプション
tr: Bölme Seçenekleri
zh_hans: 拆分选项

# splitOptions.totalFiles %lld
source: Total: %lld files
de: Gesamt: %lld Dateien
es: Total: %lld archivos
fr: Total : %lld fichiers
ja: 合計: %lld ファイル
tr: %lld dosya
zh_hans: 共计：%lld 个文件

# splitOptions.validRange
source: Valid range
de: Gültiger Bereich
es: Rango válido
fr: Plage valide
ja: 有効な範囲
tr: Geçerli aralık
zh_hans: 有效范围

source: Splitting PDF... %@
de: PDF wird geteilt... %@
es: Dividiendo PDF... %@
fr: Division du PDF... %@
ja: PDFを分割中... %@
tr: PDF bölünüyor... %@
zh_hans: 正在拆分PDF... %@

# Total: %lld file%@
source: Total: %1$lld file%2$@
de: Gesamt: %1$lld Datei%2$@
es: Total: %1$lld archivo%2$@
fr: Total : %1$lld fichier%2$@
ja: 合計: %1$lld ファイル%2$@
tr: Toplam: %1$lld dosya%2$@
zh_hans: 共计：%1$lld 个文件%2$@

source: Unable to access '%@'. Please re-select the file.
de: Zugriff auf '%@' nicht möglich. Bitte wähle die Datei erneut aus.
es: No se puede acceder a '%@'. Por favor, vuelve a seleccionar el archivo.
fr: Impossible d'accéder à « %@ ». Veuillez resélectionner le fichier.
ja: 「%@」にアクセスできません。ファイルを再度選択してください。
tr: '%@' dosyasına erişilemiyor. Lütfen dosyayı tekrar seç.
zh_hans: 无法访问「%@」。请重新选择文件。

source: This merge combines %1$lld pages (%2$@). Large merges may take a while and use significant memory. Continue?
de: Diese Zusammenführung umfasst %1$lld Seiten (%2$@). Große Zusammenführungen können eine Weile dauern und viel Arbeitsspeicher verwenden. Fortfahren?
es: Esta fusión combina %1$lld páginas (%2$@). Las fusiones grandes pueden tardar un tiempo y usar mucha memoria. ¿Continuar?
fr: Cette fusion combine %1$lld pages (%2$@). Les fusions volumineuses peuvent prendre du temps et utiliser beaucoup de mémoire. Continuer ?
ja: この結合には%1$lldページ（%2$@）が含まれます。大規模な結合には時間がかかり、多くのメモリを使用する場合があります。続行しますか？
tr: Bu birleştirme %1$lld sayfayı (%2$@) kapsıyor. Büyük birleştirmeler biraz zaman alabilir ve önemli miktarda bellek kullanabilir. Devam edilsin mi?
zh_hans: 此次合并包含 %1$lld 页（%2$@）。大型合并可能需要一些时间并占用大量内存。继续吗？

source: This merge combines %1$lld pages (%2$@) and is too large to merge safely. Try merging fewer or smaller files.
de: Diese Zusammenführung umfasst %1$lld Seiten (%2$@) und ist zu groß, um sicher zusammengeführt zu werden. Versuchen Sie, weniger oder kleinere Dateien zusammenzuführen.
es: Esta fusión combina %1$lld páginas (%2$@) y es demasiado grande para fusionarla de forma segura. Intenta fusionar menos archivos o archivos más pequeños.
fr: Cette fusion combine %1$lld pages (%2$@) et est trop volumineuse pour être fusionnée en toute sécurité. Essayez de fusionner moins de fichiers ou des fichiers plus petits.
ja: この結合には%1$lldページ（%2$@）が含まれ、安全に結合するには大きすぎます。結合するファイル数を減らすか、より小さいファイルを使用してください。
tr: Bu birleştirme %1$lld sayfayı (%2$@) kapsıyor ve güvenli şekilde birleştirmek için çok büyük. Daha az veya daha küçük dosya birleştirmeyi deneyin.
zh_hans: 此次合并包含 %1$lld 页（%2$@），过大而无法安全合并。请尝试合并更少或更小的文件。

# usage.noActionsRemaining
source: You've used all your free actions.
de: Du hast alle deine kostenlosen Aktionen aufgebraucht.
es: Has usado todas tus acciones gratuitas.
fr: Vous avez utilisé toutes vos actions gratuites.
ja: すべての無料操作を使い切りました。
tr: Tüm ücretsiz işlemlerini kullandın.
zh_hans: 你已用完所有免费操作。

# usage.persistenceFailed
source: Failed to save usage data.
de: Nutzungsdaten konnten nicht gespeichert werden.
es: Error al guardar los datos de uso.
fr: Échec de l'enregistrement des données d'utilisation.
ja: 使用データの保存に失敗しました。
tr: Kullanım verileri kaydedilemedi.
zh_hans: 保存使用数据失败。

# validation.selectMultipleForMerge
source: Please select at least 2 PDF files to merge.
de: Bitte wähle mindestens 2 PDF-Dateien zum Zusammenführen aus.
es: Por favor, selecciona al menos 2 archivos PDF para combinar.
fr: Veuillez sélectionner au moins 2 fichiers PDF à fusionner.
ja: 結合するには2つ以上のPDFファイルを選択してください。
tr: Birleştirmek için en az 2 PDF dosyası seç.
zh_hans: 请选择至少2个PDF文件进行合并。

# validation.selectOneFile
source: Please select a PDF file.
de: Bitte wähle eine PDF-Datei aus.
es: Por favor, selecciona un archivo PDF.
fr: Veuillez sélectionner un fichier PDF.
ja: PDFファイルを選択してください。
tr: Lütfen bir PDF dosyası seç.
zh_hans: 请选择一个PDF文件。

# validation.selectOnlyOne
source: Please select only one PDF file for this action.
de: Bitte wähle nur eine PDF-Datei für diese Aktion aus.
es: Por favor, selecciona solo un archivo PDF para esta acción.
fr: Veuillez ne sélectionner qu'un seul fichier PDF pour cette action.
ja: この操作には1つのPDFファイルのみ選択してください。
tr: Bu işlem için tek bir PDF dosyası seç.
zh_hans: 此操作请只选择一个PDF文件。

# action.upgrade
source: Upgrade
es: Mejorar
fr: Mettre à niveau
ja: アップグレード
tr: Yükselt
zh_hans: 升级

# settings.version
source: Version
es: Versión
ja: バージョン
tr: Sürüm
zh_hans: 版本

# settings.subscription.proPlan
source: Pro
ja: プロ
zh_hans: 专业版

# action.ok
source: OK
tr: Tamam
